CSI API ETABS v1

# cDatabaseTablesCancelTableEditing Method

---

Clears all tables that were stored in the table list using one of the
SetTableForEditing... functions.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int CancelTableEditing()

    Function CancelTableEditing As Integer

    Dim instance As cDatabaseTables
    Dim returnValue As Integer

    returnValue = instance.CancelTableEditing()

    int CancelTableEditing()

    abstract CancelTableEditing : unit -> int

#### Return Value

Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero

See Also

#### Reference

cDatabaseTables Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com